clc; clear all;
X =[-100 2 200 20]';     % 船舶初始值(横向位置，横向速度，纵向位置，纵向速度)
Xr = X;                  % 船舶理论值(横向位置，横向速度，纵向位置，纵向速度)，后续迭代更新
U = [0.1 0.1 0.1 0.1]';  % 船舶控制量（横向加速度，纵向加速度）
T = 1;                   % 采样时间
A = [1 T 0 0;            % 状态转移矩阵
     0 1 0 0;
     0 0 1 T;
     0 0 0 1];
B = [0.5*T*T 0 0 0;      % 控制矩阵
        0    T 0 0;
     0 0 0.5*T*T 0;
        0    0 0 T];
H = [1 0 0 0;            % 观测矩阵
     0 0 1 0];
P = [1 0 0 0;            % 初始化预测协方差矩阵
     0 1 0 0;
     0 0 1 0;
     0 0 0 1];
Q = [0.01 0 0 0;         % 过程噪声协方差矩阵，表示预测模型的可信度
     0 0.01 0 0;
     0 0 0.01 0;
     0 0 0 0.01];
Q_= B*Q;                 % 表示船舶加速度的噪声对预测过程的影响权重

Nx = 10*randn(1,100)';   % 表示横向位置传感器观测噪声;
Ny = 10*randn(1,100)';   % 表示纵向位置传感器观测噪声;

R =[100 0;               % 观测噪声协方差矩阵，表示传感器信号的可信度
    0 100];

figure;
hold on;
for i = 1:T:100
   Xr = A*Xr + B*U;       % 船舶理论值，随迭代更新
   N = [Nx(i) Ny(i)]';    % 每一次迭代时的传感器噪声信号（横向位置，纵向位置）
   Z = H*Xr + N;          % 船舶理论值加上传感器噪声，表示传感器观测信号（横向位置，纵向位置）
   
   X_ = A*X + B*U;        % 状态预测方程
   P_ = A*P*A'+ Q_;       % 状态预测协方差方程
   K = P_*H'/(H*P_*H'+R); % 卡尔曼增益更新方程
   X = X_ + K*(Z - H*X_); % 状态更新方程
   P = P_ - K*H*P_;       % 状态更新协方差方程
   
   plot(Xr(1),Xr(3), 'k.');
   plot(Z(1),Z(2), 'b.');
   plot(X(1),X(3), 'r.');  
   legend('理论轨迹','观测轨迹','滤波轨迹');
end